## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.name_servers["ns1-36.azure-dns.com."] will be created
  + resource "cloudflare_record" "name_servers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "games.ruut.me"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "NS"
      + value           = "ns1-36.azure-dns.com."
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.name_servers["ns2-36.azure-dns.net."] will be created
  + resource "cloudflare_record" "name_servers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "games.ruut.me"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "NS"
      + value           = "ns2-36.azure-dns.net."
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.name_servers["ns3-36.azure-dns.org."] will be created
  + resource "cloudflare_record" "name_servers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "games.ruut.me"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "NS"
      + value           = "ns3-36.azure-dns.org."
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.name_servers["ns4-36.azure-dns.info."] will be created
  + resource "cloudflare_record" "name_servers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "games.ruut.me"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "NS"
      + value           = "ns4-36.azure-dns.info."
      + zone_id         = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>